#include <stdio.h>
#include <string.h>

//输出什么？

//1.原反补计算

//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	//a=-1,b=-1,c=255
//	//10000001 原
//	//11111110 反
//	//11111111 补--->255(unsigned)
//	return 0;
//}
//2.整形提升

//int main()
//{
//	char a = -128;
//	printf("%u\n", a);
//	//%u--> unsigned int
//	//10000000  原
//	//11111111	反
//	//10000000	补-->11111111 11111111 11111111 10000000  
//	//【发生整形提升！因为是char类型的要以unsigned int 打印，符号位不变，剩下的位按照符号位数字填充】
//	return 0;
//}
//3.整形提升

//int main()
//{
//	char a = 128;
//	printf("%u\n", a);
//	//char -128~127
//	//01111111 127
// 	//10000000 127+1  --->-128  （补码）
//	//整形提升！
//	//11111111 11111111 11111111 10000000
//	return 0;
//}
//4. 补码运算练习

//int main()
//{
//	int i = -20;
//	unsigned  int  j = 10;
//	//i = 10000000 00010100 原
//	//i = 11111111 11101011	反
//	//i = 11111111 11101100	补
//	//10= 00000000 00001010 原=反=补
//	//i+j=11111111 11110110	补   -------补码才能运算
//	//i+j=11111111 11110101 反
//	//i+j=10000000 00001010 原
//	//-10
//	printf("%d\n", i + j);
//	//按照补码的形式进行运算，最后格式化成为有符号整数
//}

//5. unsigned类型 对于0再减去1之后=？

//int main()
//{
//	unsigned int i;
//	for (i = 9;i >= 0;i--)
//	{
//		printf("%u\n", i);
//	}
//	// unsigned int ---> 0~2^32-1  42亿多
//	//i=0; 00000000 00000000  0
//	//i--; 11111111 11111111  -1（✖），转化为--> unsigned int最大值 
//	//i--; 11111111 11111110	递减【死循环】
//}

//6. strlen计算char数组，考查char范围

//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));
//	//char -128~127
//	//思路：首先strlen函数只有遇到 '\0'才会停止，而'\0'对应的ASCII是0
//	//a[0]= -1
//	//		-2
//	//.....-128
//	//	   -129(✖)--->127
//	//..... 126
//	//.....  1
//	//.....  0	总计：128+127=255
//	//strlen = 255
//	return 0;
//}//7. char范围考查
//int main()
//{
//	unsigned char i = 0;
//	for (i = 0;i <= 255;i++)
//	{
//		printf("hello world\n");
//	}
//	//当i加到255	11111111//	//i再++//	//256-->		00000000	(0)
//	return 0;
//}

//浮点数例题

//int main()
//{
//	int n = 9;
//	float* p = (float*)&n;
//	printf("n=%d\n", n);
//	printf("p=%f\n", *p);
//	*p = 9.0;
//	printf("n=%d\n", n);
//	printf("p=%f\n", *p);
//}
